In [1]:
print("hello")

hello

# Step1 Data Exploration and Preprocessing

In [26]:
# import the required packages
import pandas as pd

#my sql connection toolkit 
import pymysql #this will be used to connect to the database
import sqlalchemy #this will be used to create the connection string
from sqlalchemy import create_engine

In [3]:
df = pd.read_csv("Walmart.csv")

In [4]:
df.head(5)

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,$74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,$15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48
2,3,WALM067,Haltom City,Home and lifestyle,$46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33
3,4,WALM064,Bedford,Health and beauty,$58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33
4,5,WALM013,Irving,Sports and travel,$86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48

In [5]:
# check the shape of the data and descrpitve statistics
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10051 entries, 0 to 10050
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      10051 non-null  int64
 1   Branch          10051 non-null  object
 2   City            10051 non-null  object
 3   category        10051 non-null  object
 4   unit_price      10020 non-null  object
 5   quantity        10020 non-null  float64
 6   date            10051 non-null  object
 7   time            10051 non-null  object
 8   payment_method  10051 non-null  object
 9   rating          10051 non-null  float64
 10  profit_margin   10051 non-null  float64
dtypes: float64(3), int64(1), object(7)
memory usage: 863.9+ KB

         invoice_id      quantity        rating  profit_margin
count  10051.000000  10020.000000  10051.000000   10051.000000
mean    5025.741220      2.353493      5.825659       0.393791
std     2901.174372      1.602658      1.763991       0.090669
min        1.000000      1.000000      3.000000       0.180000
25%     2513.500000      1.000000      4.000000       0.330000
50%     5026.000000      2.000000      6.000000       0.330000
75%     7538.500000      3.000000      7.000000       0.480000
max    10000.000000     10.000000     10.000000       0.570000

In [6]:
#Checking the null values in the dataset
print(df.isnull().sum())

invoice_id         0
Branch             0
City               0
category           0
unit_price        31
quantity          31
date               0
time               0
payment_method     0
rating             0
profit_margin      0
dtype: int64

In [7]:
# check the data types of the columns
df.dtypes

invoice_id          int64
Branch             object
City               object
category           object
unit_price         object
quantity          float64
date               object
time               object
payment_method     object
rating            float64
profit_margin     float64
dtype: object

In [8]:
#Finding the number of duplicates
df.duplicated().sum()

np.int64(51)

In [9]:
# drop the duplicates
df.drop_duplicates(inplace=True)

In [10]:
# check the shape of the data after dropping duplicates
print(df.shape)


# cross check the duplicated values in the dataset after dropping duplicates
print(df.duplicated().sum())

(10000, 11)
0

In [11]:
# Convert unit_price from object to float well it is in string format with $ sign
# remove the $ sign and convert to float
df['unit_price'] = pd.to_numeric(df['unit_price'].str.replace('$', ''), errors='coerce')

# Convert quantity from object to integer
df['quantity'] = pd.to_numeric(df['quantity'], errors='coerce').astype('Int64')

In [12]:
# For unit price column - replace nulls with mean
df['unit_price'] = df['unit_price'].fillna(df['unit_price'].mean())

import numpy as np
df['quantity'] = df['quantity'].fillna(int(np.floor(df['quantity'].mean())))

In [13]:
# Convert date column to datetime and time column to time format
df['date'] = pd.to_datetime(df['date'], format='%m/%d/%y', errors='coerce')

In [14]:
#replace nulls in date column with the first date in the dataset
first_date = df['date'].dropna().min()
df['date'].fillna(first_date, inplace=True)

C:\Users\manik\AppData\Local\Temp\ipykernel_18400\1695123392.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['date'].fillna(first_date, inplace=True)

In [15]:
#Now we can check the null values in the dataset
print(df.isnull().sum())

invoice_id        0
Branch            0
City              0
category          0
unit_price        0
quantity          0
date              0
time              0
payment_method    0
rating            0
profit_margin     0
dtype: int64

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10000 entries, 0 to 9999
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      10000 non-null  int64
 1   Branch          10000 non-null  object
 2   City            10000 non-null  object
 3   category        10000 non-null  object
 4   unit_price      10000 non-null  float64
 5   quantity        10000 non-null  Int64
 6   date            10000 non-null  datetime64[ns]
 7   time            10000 non-null  object
 8   payment_method  10000 non-null  object
 9   rating          10000 non-null  float64
 10  profit_margin   10000 non-null  float64
dtypes: Int64(1), datetime64[ns](1), float64(3), int64(1), object(5)
memory usage: 947.3+ KB

In [17]:
df.describe()

,invoice_id,unit_price,quantity,date,rating,profit_margin
count,10000.00000,10000.000000,10000.0,10000,10000.000000,10000.000000
mean,5000.50000,50.622142,2.3545,2020-01-24 14:20:41.280000,5.830170,0.393813
min,1.00000,10.080000,1.0,2019-01-01 00:00:00,3.000000,0.180000
25%,2500.75000,32.425000,1.0,2019-01-01 00:00:00,4.000000,0.330000
50%,5000.50000,51.000000,2.0,2019-01-01 00:00:00,6.000000,0.330000
75%,7500.25000,68.710000,3.0,2021-02-11 00:00:00,7.000000,0.480000
max,10000.00000,99.960000,10.0,2023-12-12 00:00:00,10.000000,0.570000
std,2886.89568,21.170872,1.603087,NaN,1.764097,0.090656

In [18]:
df.shape

(10000, 11)

In [24]:
df['Total'] = (df['unit_price'] * df['quantity']).round(3)
df.head(5)

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin,Total
0,1,WALM003,San Antonio,Health and beauty,74.69,7,2019-05-01,13:08:00,Ewallet,9.1,0.48,522.83
1,2,WALM048,Harlingen,Electronic accessories,15.28,5,2019-08-03,10:29:00,Cash,9.6,0.48,76.4
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7,2019-03-03,13:23:00,Credit card,7.4,0.33,324.31
3,4,WALM064,Bedford,Health and beauty,58.22,8,2019-01-01,20:33:00,Ewallet,8.4,0.33,465.76
4,5,WALM013,Irving,Sports and travel,86.31,7,2019-08-02,10:37:00,Ewallet,5.3,0.48,604.17

In [27]:
# mysql
# host  = 'localhost'
# port  = 3306
# user = 'root'
# password = 'sqlroot2222'

In [28]:
df.to_csv('Walmart_cleaned.csv', index=False)

In [30]:
#mysql connection
engine_mysql = create_engine('mysql+pymysql://root:sqlroot2222@localhost:3306/walmart_db')
try : 
    engine_mysql.connect()
    print("Connected to MySQL database")
except Exception as e:
    print("Error connecting to MySQL database", e)

Connected to MySQL database

In [35]:
df.to_sql(name='walmart_sales', con=engine_mysql, if_exists='append', index=False)

10000

In [32]:
df.columns

Index(['invoice_id', 'Branch', 'City', 'category', 'unit_price', 'quantity',
       'date', 'time', 'payment_method', 'rating', 'profit_margin', 'Total'],
      dtype='object')

In [33]:
df.columns = df.columns.str.lower()